tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "git"
brew "gnupg"
brew "htop"
brew "mas"
brew "node"
cask "1password"
cask "docker"
cask "firefox-developer-edition"
cask "gpg-suite"
cask "intel-power-gadget"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "little-snitch"
cask "logitech-options"
cask "pocket-casts"
cask "protonmail-bridge"
cask "protonvpn"
cask "spotify"
cask "telegram"
cask "vanilla"
mas "feedly", id: 865500966
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
