tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "reznikov/cardo-unofficial"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Create Docker hosts locally and on cloud providers
brew "docker-machine", restart_service: true
# GNU compiler collection
brew "gcc"
# Command-line JSON processing tool
brew "fx"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Use Realtek DVB-T dongles as a cheap SDR
brew "librtlsdr"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn", restart_service: true
# Pretty, minimal and fast ZSH prompt
brew "pure", link: false
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Universal Radio Hacker
brew "urh"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
cask "autodesk-fusion360"
# Menu bar icon organizer
cask "bartender"
# Web browser focusing on privacy
cask "brave-browser"
cask "cardo-update"
# Cryptocurrency wallet for ada on the Cardano blockchain
cask "daedalus-mainnet"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox-developer-edition"
# Typeface made for developers
cask "font-jetbrains-mono"
# Tools to protect your emails and files
cask "gpg-suite"
# Automated organization
cask "hazel"
# Typography keyboard layout
cask "ilya-birman-typography-layout"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Host-based application firewall
cask "little-snitch"
# Software for Logitech devices
cask "logitech-options"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Programmable solid 3D CAD modeller
cask "openscad"
# Bridges ProtonMail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# VPN client focusing on security
cask "protonvpn"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Emoji picker optimized for blind people
cask "rocket"
# Instant messaging application focusing on security
cask "signal"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Virtualizer for x86 hardware
cask "virtualbox"
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# YubiKey tool
cask "yubico-yubikey-personalization-gui"
mas "feedly", id: 865500966
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "MQTT Explorer", id: 1455214828
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
