# Core CLI tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "git"
brew "git-lfs"
brew "jq"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"

# Development
brew "fnm"

# Casks
cask "ghostty"
cask "git-credential-manager"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
