tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "reznikov/cardo-unofficial"
tap "reznikov/sshpass"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Tool for exploring each layer in a docker image
brew "dive"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
cask "1password"
cask "autodesk-fusion360"
cask "bartender"
cask "cardo-update"
cask "docker"
cask "firefox-developer-edition"
cask "font-jetbrains-mono"
cask "gpg-suite"
cask "intellij-idea"
cask "iterm2"
cask "little-snitch"
cask "logitech-options"
cask "notion"
cask "pocket-casts"
cask "postman"
cask "protonmail-bridge"
cask "protonvpn"
cask "prusaslicer"
cask "rocket"
cask "soundsource"
cask "spotify"
cask "telegram"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "visual-studio-code"
cask "wireshark"
mas "feedly", id: 865500966
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
